[
  {
    "id": "A. Material Verification"
  },
  {
    "id": 1,
    "text": "Ceiling type, grid profile, and acoustic tile model match approved submittals"
  },
  {
    "id": 2,
    "text": "Tile NRC (Noise Reduction Coefficient), CAC (Ceiling Attenuation Class) ratings match spec"
  },
  {
    "id": 3,
    "text": "Suspension wires, main tees, cross tees, trims, and hold-down clips reviewed and received"
  },
  {
    "id": "B. Pre-Installation Checks"
  },
  {
    "id": 4,
    "text": "Mechanical, electrical, and sprinkler rough-ins completed and coordinated with ceiling layout"
  },
  {
    "id": 5,
    "text": "Perimeter wall angles installed level, continuous, and at correct height"
  },
  {
    "id": 6,
    "text": "Existing ceiling and services removed (if applicable); substrate conditions verified"
  },
  {
    "id": "C. Grid Suspension Installation"
  },
  {
    "id": 7,
    "text": "Suspension wires installed to structure and spaced per code (typically 4’ o.c.)"
  },
  {
    "id": 8,
    "text": "Grid levelled and aligned with laser or string line"
  },
  {
    "id": 9,
    "text": "Main tees and cross tees clipped securely, square, and tight"
  },
  {
    "id": 10,
    "text": "Seismic bracing installed where required"
  },
  {
    "id": "D. Tile Installation"
  },
  {
    "id": 11,
    "text": "Tiles cut cleanly, seated flat in grid, and corners square"
  },
  {
    "id": 12,
    "text": "Tiles installed tight to grid with no sagging or gaps"
  },
  {
    "id": 13,
    "text": "Tiles around lights, grilles, sprinklers cut and trimmed neatly"
  },
  {
    "id": 14,
    "text": "Damaged tiles replaced before handover"
  },
  {
    "id": "E. Coordination & Final Review"
  },
  {
    "id": 15,
    "text": "Access panels, light fixtures, and HVAC diffusers properly supported"
  },
  {
    "id": 16,
    "text": "Final height and alignment confirmed with reflected ceiling plan (RCP)"
  },
  {
    "id": 17,
    "text": "Punch list reviewed and deficiencies corrected"
  },
  {
    "id": 18,
    "text": "Closeout documents submitted including warranties and acoustical performance data"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NBC, ASTM C635 / C636 – Grid and Suspension Systems"
  },
  {
    "id": "• ASTM E1264 / E84 – Acoustic Tile Performance"
  },
  {
    "id": "• Seismic Code (NBCC 2020, Zone-Specific)"
  },
  {
    "id": "• Manufacturer Specs: Armstrong, CertainTeed, CGC, Rockfon, USG"
  }
]