[
  {
    "id": "A. Submittals & Mix Design Review"
  },
  {
    "id": 1,
    "text": "Approved paving drawings and pavement design (thickness, lifts, materials) reviewed"
  },
  {
    "id": 2,
    "text": "Asphalt mix design (job-mix formula, JMF) approved by consultant or city"
  },
  {
    "id": 3,
    "text": "Weather conditions checked: ambient >5°C, surface dry, and no rain forecasted"
  },
  {
    "id": "B. Subgrade and Base Preparation"
  },
  {
    "id": 4,
    "text": "Subgrade compacted and tested for density and moisture content"
  },
  {
    "id": 5,
    "text": "Granular base (GBC or equivalent) placed in lifts and compacted to 100% standard Proctor"
  },
  {
    "id": 6,
    "text": "Proof rolling completed and approved by consultant prior to asphalt placement"
  },
  {
    "id": "C. Asphalt Placement"
  },
  {
    "id": 7,
    "text": "Paver preheated and screed adjusted for thickness and slope"
  },
  {
    "id": 8,
    "text": "Tack coat applied evenly to cold joint or milled surface"
  },
  {
    "id": 9,
    "text": "Asphalt temperature upon delivery recorded (typically >120°C for hot-mix)"
  },
  {
    "id": 10,
    "text": "Paving completed in accordance with lift thickness (e.g., 50 mm base, 40 mm surface)"
  },
  {
    "id": "D. Compaction and Testing"
  },
  {
    "id": 11,
    "text": "Steel drum and pneumatic rollers used within temperature window"
  },
  {
    "id": 12,
    "text": "Joint compaction and overlaps inspected (cold joints reheated if needed)"
  },
  {
    "id": 13,
    "text": "Core or nuclear density tests taken and meet compaction spec (typically >92% of max density)"
  },
  {
    "id": "E. Surface and Closeout"
  },
  {
    "id": 14,
    "text": "Final grade and cross slope confirmed with straight edge and/or level"
  },
  {
    "id": 15,
    "text": "Surface finish smooth, with no tearing, segregation, or roller marks"
  },
  {
    "id": 16,
    "text": "Traffic allowed only after full cooling or as specified in project documents"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• CSA A23.2, A3000, ASTM D6925, D2041, D2950"
  },
  {
    "id": "• Alberta Transportation Specs, Municipal Road Standards, HMA Best Practices"
  }
]