[
  {
    "id": "A. Submittals & Planning Review"
  },
  {
    "id": 1,
    "text": "Camera type (bullet, dome, PTZ), resolution, field of view, and mounting verified with spec and layout"
  },
  {
    "id": 2,
    "text": "Camera coverage map reviewed with critical area visibility checked (entrances, corridors, parking, elevators)"
  },
  {
    "id": 3,
    "text": "NVR/DVR sizing, hard drive capacity, video retention period meet spec (typically 30–90 days)"
  },
  {
    "id": "B. Camera Installation"
  },
  {
    "id": 4,
    "text": "Cameras mounted level, aligned, and protected from vandalism/environment"
  },
  {
    "id": 5,
    "text": "Camera junction boxes, pole brackets, and armatures installed securely"
  },
  {
    "id": 6,
    "text": "IP address assigned, MAC address logged, and connection to POE switch/NVR confirmed"
  },
  {
    "id": "C. Cabling & Power"
  },
  {
    "id": 7,
    "text": "CAT6 or coaxial cable terminated correctly and tested for continuity and speed"
  },
  {
    "id": 8,
    "text": "POE switches installed and labeled; power budget per port verified"
  },
  {
    "id": 9,
    "text": "Surge protection and grounding provided at key panels and field terminations"
  },
  {
    "id": "D. NVR/Software Configuration"
  },
  {
    "id": 10,
    "text": "NVR mounted in secure location, with UPS backup and HVAC cooling"
  },
  {
    "id": 11,
    "text": "Time, resolution, camera naming, frame rate, and retention settings configured"
  },
  {
    "id": 12,
    "text": "Remote viewing stations and login permissions tested and documented"
  },
  {
    "id": "E. Functional Testing & Handover"
  },
  {
    "id": 13,
    "text": "Live view, motion detection, night vision, and PTZ controls (if applicable) tested"
  },
  {
    "id": 14,
    "text": "Recorded playback tested for quality, date/time stamp, and exported formats"
  },
  {
    "id": 15,
    "text": "As-built camera map, user manual, and commissioning documents submitted"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NFPA 730, IEC 62676, UL 2802, ONVIF Profile S/G"
  },
  {
    "id": "• Manufacturer Specs: Axis, Bosch, Hanwha, Hikvision, Avigilon, Milestone, Genetec"
  }
]