[
  {
    "id": "A. Submittals & Pre-Installation"
  },
  {
    "id": 1,
    "text": "Submittals approved for all duct materials, sizes, gauges, fittings, and accessories per SMACNA"
  },
  {
    "id": 2,
    "text": "Coordination confirmed with structural, electrical, sprinkler (avoid conflicts, enough space)"
  },
  {
    "id": 3,
    "text": "Shop drawings include elevations, turning vanes, transitions, and damper access"
  },
  {
    "id": "B. Fabrication & Delivery"
  },
  {
    "id": 4,
    "text": "Duct gauge and reinforcements confirmed based on size and pressure class"
  },
  {
    "id": 5,
    "text": "All duct sections delivered clean, protected from weather and damage"
  },
  {
    "id": 6,
    "text": "Duct insulation type, thickness, and vapor barrier verified"
  },
  {
    "id": "C. Installation Checks"
  },
  {
    "id": 7,
    "text": "Ducts installed plumb, level, properly supported per SMACNA standards (hanger spacing, support for risers)"
  },
  {
    "id": 8,
    "text": "Flexible duct lengths within limits (max 5–6 ft), and not kinked or compressed"
  },
  {
    "id": 9,
    "text": "Turning vanes installed in elbows where required"
  },
  {
    "id": 10,
    "text": "Volume dampers and access doors installed where shown and accessible"
  },
  {
    "id": 11,
    "text": "Smoke/fire dampers installed with breakaway joints, sleeves, fusible links, and access"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 12,
    "text": "Ductwork sealed (SMACNA Class A/B/C) per pressure class; leak test performed if required"
  },
  {
    "id": 13,
    "text": "All diffusers, grilles, registers (DGRs) installed per reflected ceiling plan"
  },
  {
    "id": 14,
    "text": "Duct insulation continuous and free of tears or exposed gaps"
  },
  {
    "id": 15,
    "text": "Final cleaning completed prior to startup (negative air sweep or vacuum)"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• SMACNA Duct Construction Standards, ASHRAE 62.1, NBC 2019 Part 6, NECB"
  },
  {
    "id": "• NFPA 90A/90B, CSA F326 (Residential Air Distribution)"
  },
  {
    "id": "• Manufacturer Specs: Greenheck, Carnes, Price, Nailor, Loren Cook"
  }
]