[
  {
    "id": "A. Submittal Review & Coordination"
  },
  {
    "id": 1,
    "text": "Elevator type (hydraulic, traction, MRL), capacity, speed, stops match drawings and spec"
  },
  {
    "id": 2,
    "text": "Shop drawings and layout approved by consultant and coordinated with structural and MEP trades"
  },
  {
    "id": 3,
    "text": "Cab finish schedule (walls, flooring, handrails, ceiling) matches architectural design intent"
  },
  {
    "id": 4,
    "text": "Power requirement, shaft ventilation, and lighting coordinated"
  },
  {
    "id": "B. Shaft & Pit Preparation"
  },
  {
    "id": 5,
    "text": "Shaft dimensions verified against elevator supplier layout"
  },
  {
    "id": 6,
    "text": "Pit depth, sump pump, and waterproofing installed per manufacturer and local code"
  },
  {
    "id": 7,
    "text": "Hoist beam, brackets, and embedded steel placed per elevator supplier drawings"
  },
  {
    "id": 8,
    "text": "Machine room or overhead clearance provided per shop drawings"
  },
  {
    "id": "C. Installation Monitoring"
  },
  {
    "id": 9,
    "text": "Rails, buffers, hoist cables (if applicable) installed and aligned"
  },
  {
    "id": 10,
    "text": "Car frame, counterweight, and guide shoes assembled per spec"
  },
  {
    "id": 11,
    "text": "Cab enclosure installed, finish materials protected until turnover"
  },
  {
    "id": 12,
    "text": "Doors, operators, and door tracks aligned and function-tested"
  },
  {
    "id": 13,
    "text": "Fire recall, intercom, emergency lighting, and battery backup installed"
  },
  {
    "id": "D. Final Inspection & Certification"
  },
  {
    "id": 14,
    "text": "Safety tests completed: load test, overspeed, emergency brake"
  },
  {
    "id": 15,
    "text": "Inspection passed by provincial/state elevator authority (e.g., TSSA, ASME inspector)"
  },
  {
    "id": 16,
    "text": "Final cleaning, decals, Braille signage, and safety notices installed"
  },
  {
    "id": 17,
    "text": "Warranty, logbooks, and operation manual submitted"
  },
  {
    "id": 18,
    "text": "Handover & owner/operator training confirmed"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ASME A17.1 / CSA B44, ADA / CSA B651, NBC, TSSA (Ontario)"
  },
  {
    "id": "• ISO 4190, Manufacturer Specs: Otis, KONE, ThyssenKrupp, Schindler, Mitsubishi"
  }
]