[
  {
    "id": "A. Submittals & Design Review"
  },
  {
    "id": 1,
    "text": "Generator sizing, voltage, phase, and fuel type match electrical schedule and one-line diagram"
  },
  {
    "id": 2,
    "text": "ATS ratings, number of poles, and location per shop drawings and CSA C282 (or NEC Article 700/701)"
  },
  {
    "id": 3,
    "text": "Life safety system loads separated and properly labeled"
  },
  {
    "id": "B. Equipment Installation"
  },
  {
    "id": 4,
    "text": "Generator pad and housing installed per manufacturer spec with seismic anchoring (if required)"
  },
  {
    "id": 5,
    "text": "Exhaust, intake, and fuel lines routed and tested for leaks"
  },
  {
    "id": 6,
    "text": "Generator grounding electrode and bonding installed and tested"
  },
  {
    "id": 7,
    "text": "ATS installed level, wired correctly for both normal and emergency sources"
  },
  {
    "id": 8,
    "text": "Critical loads wired per fire/life safety codes with no unauthorized loads connected"
  },
  {
    "id": "C. Functional Testing & Startup"
  },
  {
    "id": 9,
    "text": "Generator pre-start inspection completed: oil, coolant, battery, fuel, alarms"
  },
  {
    "id": 10,
    "text": "Generator started manually and under automatic transfer"
  },
  {
    "id": 11,
    "text": "ATS functionality verified: time delay, sensing, transfer, re-transfer"
  },
  {
    "id": 12,
    "text": "Emergency loads picked up and de-energized without issue during test"
  },
  {
    "id": 13,
    "text": "Load bank test or connected full-load test conducted and recorded (as required)"
  },
  {
    "id": 14,
    "text": "Run time verification per spec (e.g., 2 hrs full load or as per CSA/NEC)"
  },
  {
    "id": "D. Closeout & Documentation"
  },
  {
    "id": 15,
    "text": "As-built single-line, test logs, fuel certification (for diesel), and CSA/UL label on generator submitted"
  },
  {
    "id": 16,
    "text": "Local AHJ or fire department signoff completed"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• CSA C282, NEC Articles 700/701, NFPA 110, UL 2200, NBC Part 3 & 6"
  },
  {
    "id": "• Manufacturer Specs: Generac, Kohler, Cummins, MTU, ASCO, Eaton"
  }
]