[
  {
    "id": "A. Material Verification"
  },
  {
    "id": 1,
    "text": "Epoxy/resinous floor system type (self-leveling, flake, quartz, urethane) matches approved submittals"
  },
  {
    "id": 2,
    "text": "Coating thickness and system components (primer, base coat, broadcast media, topcoat) confirmed"
  },
  {
    "id": 3,
    "text": "Material stored per manufacturer guidelines (temperature, humidity, shelf life)"
  },
  {
    "id": 4,
    "text": "SDS, VOC data, and finish samples submitted and approved"
  },
  {
    "id": "B. Substrate Evaluation & Prep"
  },
  {
    "id": 5,
    "text": "Substrate dry, clean, free from curing compound, sealers, or laitance"
  },
  {
    "id": 6,
    "text": "Moisture test (ASTM F2170 or F1869) conducted and passed"
  },
  {
    "id": 7,
    "text": "Surface prep performed (shot blast, grind, scarify) to meet CSP level per spec (e.g., CSP 3–5)"
  },
  {
    "id": 8,
    "text": "Repairs to cracks, divots, joints, and edges completed"
  },
  {
    "id": "C. Installation Process"
  },
  {
    "id": 9,
    "text": "Primer coat applied and allowed proper cure"
  },
  {
    "id": 10,
    "text": "Base coat applied evenly at specified thickness (in mils or mm)"
  },
  {
    "id": 11,
    "text": "Aggregate/flakes/quartz broadcast uniformly if system requires"
  },
  {
    "id": 12,
    "text": "Topcoat applied at specified DFT (dry film thickness) and spread rate"
  },
  {
    "id": 13,
    "text": "Cove base or vertical upturns installed (if applicable)"
  },
  {
    "id": "D. Final Inspection"
  },
  {
    "id": 14,
    "text": "Surface texture, color, sheen, and gloss consistent throughout"
  },
  {
    "id": 15,
    "text": "No pinholes, bubbles, fisheyes, or delamination"
  },
  {
    "id": 16,
    "text": "Slip resistance tested and meets project criteria (ASTM D2047 / ANSI A137.1)"
  },
  {
    "id": 17,
    "text": "Coating cure complete before traffic allowed"
  },
  {
    "id": 18,
    "text": "Closeout documents submitted (maintenance manual, warranty, installer certification)"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ASTM F3010 / F1869 / F2170 / D2047, ACI 515.2, LEED VOC"
  },
  {
    "id": "• Manufacturer Specs: Sika, Tnemec, Stonhard, Dur-A-Flex, Flowcrete, Sherwin-Williams"
  },
  {
    "id": "• Slab prep guide per ICRI CSP standards (Concrete Surface Profile)"
  }
]