[
  {
    "id": "A. Submittals & Design Coordination"
  },
  {
    "id": 1,
    "text": "Exhaust fan type, airflow, static pressure, voltage, and controls match schedule"
  },
  {
    "id": 2,
    "text": "Duct material, gauge, insulation, and layout match submittals and SMACNA/NFPA standards"
  },
  {
    "id": 3,
    "text": "Locations coordinated with architectural and structural elements, especially for garage or kitchen exhaust"
  },
  {
    "id": "B. Installation – Fans & Ducts"
  },
  {
    "id": 4,
    "text": "Fan installed plumb and level, vibration-isolated, with backdraft damper if required"
  },
  {
    "id": 5,
    "text": "Toilet and general exhaust duct slope to fan/roof per spec; sealed, firestopped"
  },
  {
    "id": 6,
    "text": "Kitchen exhaust duct welded, sloped, continuous, grease-rated per NFPA 96"
  },
  {
    "id": 7,
    "text": "Garage exhaust ductwork low-leakage and fire-smoke dampers accessible and tagged"
  },
  {
    "id": 8,
    "text": "Roof/wall penetration flashed and sealed properly"
  },
  {
    "id": "C. Controls & Interlocks"
  },
  {
    "id": 9,
    "text": "Fans interlocked with lights (toilet), hoods and make-up air (kitchen), or CO sensors (garage)"
  },
  {
    "id": 10,
    "text": "CO/NO2 sensors installed per design, calibrated and interlocked to VFD/fans"
  },
  {
    "id": 11,
    "text": "BAS/DDC points connected: fan status, alarms, airflow, override"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 12,
    "text": "Airflow verified via TAB: each grille, hood, exhaust stack"
  },
  {
    "id": 13,
    "text": "Kitchen hood pressure test (grease duct) and airflow balance completed"
  },
  {
    "id": 14,
    "text": "Sound and vibration within acceptable limits"
  },
  {
    "id": 15,
    "text": "AHJ inspection and fire authority clearance passed for grease hood (if applicable)"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NFPA 90A, 96, SMACNA HVAC Duct Construction, ASHRAE 62.1, NECB 2020, NBC Part 6"
  },
  {
    "id": "• CSA C282 (Garage Fans/CO Interlocks), CAN/ULC-S649 (Grease Duct)"
  },
  {
    "id": "• Manufacturer Specs: Greenheck, Broan, CaptiveAire, Fantech, Loren Cook"
  }
]