[
  {
    "id": "A. Material Verification"
  },
  {
    "id": 1,
    "text": "Sheathing type and thickness per approved submittals (gypsum/cement/OSB/plywood)"
  },
  {
    "id": 2,
    "text": "Fasteners, adhesives, joint tape, and corner reinforcement match system spec"
  },
  {
    "id": 3,
    "text": "Products stored dry, protected from moisture and impact"
  },
  {
    "id": "B. Wall Framing Inspection"
  },
  {
    "id": 4,
    "text": "Wall framing checked for plumb, alignment, and stud spacing"
  },
  {
    "id": 5,
    "text": "Blocking and structural elements in place prior to sheathing"
  },
  {
    "id": "C. Installation of Sheathing Panels"
  },
  {
    "id": 6,
    "text": "Panels cut cleanly and installed with joints centered over framing"
  },
  {
    "id": 7,
    "text": "Horizontal joints staggered between courses of panels"
  },
  {
    "id": 8,
    "text": "Fastener spacing and edge distance per spec (e.g., 8\" o.c. field / 6\" o.c. edge)"
  },
  {
    "id": 9,
    "text": "Fasteners flush to surface, not overdriven or protruding"
  },
  {
    "id": 10,
    "text": "Sheathing installed with required gap at panel edges (as per product)"
  },
  {
    "id": "D. Penetrations, Openings, and Coordination"
  },
  {
    "id": 11,
    "text": "Window and door openings accurately cut and flashed or prepared for WRB"
  },
  {
    "id": 12,
    "text": "Coordination with MEP and envelope trades to avoid rework at penetrations"
  },
  {
    "id": "E. Sheathing Finish and Protection"
  },
  {
    "id": 13,
    "text": "Sealant, tape, or joint treatment applied per sheathing manufacturer spec"
  },
  {
    "id": 14,
    "text": "Sheathing protected from prolonged exposure prior to WRB or cladding installation"
  },
  {
    "id": 15,
    "text": "Temporary protection (e.g., tarp) installed during rain or overnight if WRB not installed yet"
  },
  {
    "id": "F. QA/QC Final Review"
  },
  {
    "id": 16,
    "text": "QA/QC review complete and documented prior to WRB install"
  },
  {
    "id": 17,
    "text": "Punch list items resolved prior to enclosing assembly"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NBC Part 9 & 5 – Wall Construction and Sheathing"
  },
  {
    "id": "• CSA O325 / ASTM C1177 / ASTM C1288 – Sheathing Standards"
  },
  {
    "id": "• Manufacturer Specs: Georgia-Pacific (DensGlass), USG, James Hardie, LP"
  },
  {
    "id": "• Envelope Consultant and WRB Coordination Requirements"
  }
]