[
  {
    "id": "A. Submittals & Design Review"
  },
  {
    "id": 1,
    "text": "Fire alarm system design and one-line diagram reviewed and approved"
  },
  {
    "id": 2,
    "text": "System classification (NFPA 72) and code compliance (local authority) verified"
  },
  {
    "id": 3,
    "text": "Notification appliances, detection devices, and control panel specifications confirmed"
  },
  {
    "id": "B. Equipment Installation"
  },
  {
    "id": 4,
    "text": "Fire alarm control panel (FACP) installed in accessible, ventilated location with proper seismic anchorage"
  },
  {
    "id": 5,
    "text": "Wiring installed per code, securely fastened, and properly tagged"
  },
  {
    "id": 6,
    "text": "Fire alarm devices (detectors, pull stations, horns, strobes) installed in proper locations as per design"
  },
  {
    "id": 7,
    "text": "Manual pull stations mounted at proper height, with clear labeling and unobstructed access"
  },
  {
    "id": 8,
    "text": "Smoke and heat detectors located and installed per NFPA and manufacturer specifications"
  },
  {
    "id": "C. System Integration & Wiring"
  },
  {
    "id": 9,
    "text": "Interconnection between fire alarm control panel and HVAC, elevators, lighting systems verified"
  },
  {
    "id": 10,
    "text": "Emergency power supply (UPS or generator) for fire alarm panel confirmed and tested"
  },
  {
    "id": 11,
    "text": "Circuiting for notification and detection devices confirmed, polarity checked"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 12,
    "text": "System tested for all alarm conditions (smoke, heat, manual, supervisory)"
  },
  {
    "id": 13,
    "text": "Notification devices activated and verified for adequate coverage (audible and visible alarms)"
  },
  {
    "id": 14,
    "text": "Signal integrity, communication with monitoring station (if applicable) tested"
  },
  {
    "id": 15,
    "text": "Final alarm test (with fire department coordination, if necessary) completed and signed off"
  },
  {
    "id": "E. Closeout & Documentation"
  },
  {
    "id": 16,
    "text": "As-built drawings, system schematics, and point-to-point test logs submitted"
  },
  {
    "id": 17,
    "text": "Operator training completed, with system manual and emergency procedures provided"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NFPA 72, NFPA 101, CSA C22.1 (CEC), UL 864, IBC 2018, NBC 2019"
  },
  {
    "id": "• Manufacturer Specs: Honeywell, Siemens, Bosch, Johnson Controls, Kidde, Hochiki"
  }
]