[
  {
    "id": "A. Room Conditions & Environmental Setup"
  },
  {
    "id": 1,
    "text": "Room dimensions and ceiling height meet project specs and TIA-569-E guidelines"
  },
  {
    "id": 2,
    "text": "HVAC installed to maintain 18–27°C with dedicated exhaust or cooling path"
  },
  {
    "id": 3,
    "text": "Dust, water, plumbing, or unrelated equipment not present in room"
  },
  {
    "id": "B. Electrical & Grounding"
  },
  {
    "id": 4,
    "text": "Dedicated 120V/208V 20A circuits for racks and IT gear installed per design"
  },
  {
    "id": 5,
    "text": "Telecom Grounding Busbar (TGB) installed and bonded to main building ground per TIA-607-D"
  },
  {
    "id": 6,
    "text": "Racks and ladder tray bonded to TGB with labeled #6 AWG minimum grounding wire"
  },
  {
    "id": "C. Racks, Cable Tray, and Termination Layout"
  },
  {
    "id": 7,
    "text": "Equipment racks, ladder trays, wall fields, and cabinet layouts match shop drawings"
  },
  {
    "id": 8,
    "text": "Fiber management systems and radius guides installed to spec"
  },
  {
    "id": 9,
    "text": "Cable tray clearances maintained above and below for lighting, access, and ceiling grid"
  },
  {
    "id": 10,
    "text": "Patch panels, termination blocks, and sleeves labeled per TIA-606 standards"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 11,
    "text": "Fiber and copper cables within racks tested and terminated to rack elevations"
  },
  {
    "id": 12,
    "text": "Power tested at each rack/cabinet PDU"
  },
  {
    "id": 13,
    "text": "All equipment racks labeled and bolted securely to floor"
  },
  {
    "id": "E. Closeout & Documentation"
  },
  {
    "id": 14,
    "text": "As-built layout, grounding diagram, elevation views, and labeling maps submitted"
  },
  {
    "id": 15,
    "text": "Commissioning report, warranty documents, and asset registry submitted"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ANSI/TIA-569-E, TIA-607-D, TIA-606-B, BICSI 002, CSA T530, NEC Article 800"
  },
  {
    "id": "• Manufacturer Specs: Chatsworth, Panduit, APC, Legrand, Middle Atlantic, Vertiv"
  }
]