[
  {
    "id": "A. Submittals & Controls Review"
  },
  {
    "id": 1,
    "text": "Approved control narrative, zoning diagrams, and fixture schedules reviewed"
  },
  {
    "id": 2,
    "text": "Sensor types and locations (ceiling, wall, dual-tech) coordinated and shown on drawings"
  },
  {
    "id": 3,
    "text": "Daylight zones defined and photocells located per design and LEED intent (if applicable)"
  },
  {
    "id": "B. Device Installation"
  },
  {
    "id": 4,
    "text": "Sensors and switches installed at correct height, orientation, and range adjusted"
  },
  {
    "id": 5,
    "text": "All wall stations, keypads, dimmers, and override switches installed cleanly and labeled"
  },
  {
    "id": 6,
    "text": "Low-voltage wiring terminated, tagged, and run in dedicated conduits"
  },
  {
    "id": 7,
    "text": "Panelboard relays and lighting controllers mounted in labeled, accessible locations"
  },
  {
    "id": "C. Integration & Programming"
  },
  {
    "id": 8,
    "text": "Lighting control system networked with BAS (if required) and IP address mapped"
  },
  {
    "id": 9,
    "text": "Dimming and switching logic programmed as per room functions"
  },
  {
    "id": 10,
    "text": "Daylight harvesting, occupancy timeout, and override settings uploaded and tested"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 11,
    "text": "Zone-by-zone test for sensor response, dimming control, and relay behavior"
  },
  {
    "id": 12,
    "text": "Emergency lighting override tested and functional"
  },
  {
    "id": 13,
    "text": "Lighting schedules (weekday/weekend/holiday) uploaded and validated"
  },
  {
    "id": 14,
    "text": "Graphics interface (if applicable) reviewed with client"
  },
  {
    "id": "E. Closeout"
  },
  {
    "id": 15,
    "text": "Final commissioning report, zone maps, and user override instructions submitted"
  },
  {
    "id": 16,
    "text": "Operator training complete and system login credentials handed off"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ASHRAE 90.1, NECB Lighting Controls, IECC Section C405, CSA C22.1"
  },
  {
    "id": "• LEED v4 Lighting Credit"
  },
  {
    "id": "• Manufacturer Specs: Lutron, Crestron, Leviton, Acuity, nLight, Encelium"
  }
]