[
  {
    "id": "A. Submittals & Design Coordination"
  },
  {
    "id": 1,
    "text": "Fixture submittals match approved schedules: types, wattage, beam angle, IP rating, finish"
  },
  {
    "id": 2,
    "text": "Mounting and cutout dimensions coordinated with ceilings/walls (ACT, GWB, millwork, concrete)"
  },
  {
    "id": 3,
    "text": "Emergency and exit fixtures shown and labeled on plans, including battery backup type"
  },
  {
    "id": "B. Installation – Interior Fixtures"
  },
  {
    "id": 4,
    "text": "Fixture securely mounted (recessed clips, brackets, pendant kits) per manufacturer instructions"
  },
  {
    "id": 5,
    "text": "J-boxes or mounting rails installed level and rated for load"
  },
  {
    "id": 6,
    "text": "Fixture wiring connected with proper polarity, bonding, and strain relief"
  },
  {
    "id": 7,
    "text": "Trims, lenses, and diffusers installed without scratches or gaps"
  },
  {
    "id": 8,
    "text": "Emergency lighting circuits separately identified and operational"
  },
  {
    "id": "C. Installation – Exterior & Site Lighting"
  },
  {
    "id": 9,
    "text": "Pole base depth, anchor bolts, leveling, and conduit entry verified"
  },
  {
    "id": 10,
    "text": "Site luminaires mounted to pole with gaskets, anti-vibration washers, and wired per code"
  },
  {
    "id": 11,
    "text": "Photocell or time-clock control integrated and tested"
  },
  {
    "id": "D. Circuiting & Testing"
  },
  {
    "id": 12,
    "text": "Fixture loads match circuit breaker and wiring gauge"
  },
  {
    "id": 13,
    "text": "Dimming zones and switching logic confirmed to match control intent"
  },
  {
    "id": 14,
    "text": "Lighting control panel connections verified and tagged"
  },
  {
    "id": 15,
    "text": "Final aiming, focusing, and beam spread tested and documented"
  },
  {
    "id": "E. Closeout"
  },
  {
    "id": 16,
    "text": "As-built fixture schedule and circuit references submitted"
  },
  {
    "id": 17,
    "text": "Manufacturer warranty tags, commissioning forms, and programming documents handed over"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• CEC CSA C22.1, ASHRAE 90.1 Lighting Power Density, NECB, NBC Emergency Lighting"
  },
  {
    "id": "• IESNA Guidelines, Manufacturer Specs: Cooper, Lithonia, Signify, Cree, Focal Point, Acuity, Lightolier"
  }
]