[
  {
    "id": "A. Submittals & Pre-Delivery Review"
  },
  {
    "id": 1,
    "text": "Shop drawings and structural design reviewed and approved"
  },
  {
    "id": 2,
    "text": "Anchor bolt plans issued and coordinated with foundation design"
  },
  {
    "id": 3,
    "text": "Certified engineered drawings (stamped) submitted and match building permit set"
  },
  {
    "id": 4,
    "text": "Delivery checklist confirmed: main frames, girts, purlins, panels, accessories, fasteners"
  },
  {
    "id": "B. Foundation and Anchor Bolt Prep"
  },
  {
    "id": 5,
    "text": "Anchor bolts installed per layout, elevations, and embedment requirements"
  },
  {
    "id": 6,
    "text": "Bolt threads clean, protected, and plumb prior to structural steel arrival"
  },
  {
    "id": 7,
    "text": "Concrete flatness, level, and hold-down locations verified"
  },
  {
    "id": "C. Frame Erection"
  },
  {
    "id": 8,
    "text": "Structural steel members inspected for damage, twist, corrosion"
  },
  {
    "id": 9,
    "text": "Frames erected plumb and braced per sequence in erection manual"
  },
  {
    "id": 10,
    "text": "Bolts torqued and documented per manufacturer's tensioning specs"
  },
  {
    "id": 11,
    "text": "Temporary bracing in place during all phases of erection until diaphragm secured"
  },
  {
    "id": "D. Roof and Wall Panel Installation"
  },
  {
    "id": 12,
    "text": "Insulation, vapor barrier, and liner panels (if used) installed as per system"
  },
  {
    "id": 13,
    "text": "Panels installed straight, with correct lap orientation and spacing"
  },
  {
    "id": 14,
    "text": "Fasteners spaced per drawing and properly seated (not overdriven/underdriven)"
  },
  {
    "id": 15,
    "text": "Flashing, trim, sealant, and closures installed without gaps or buckling"
  },
  {
    "id": "E. Final Inspection & Closeout"
  },
  {
    "id": 16,
    "text": "Downspouts, gutters, ridge vents, and louvers installed complete"
  },
  {
    "id": 17,
    "text": "Punch list items (panel scratches, open seams, missing hardware) corrected"
  },
  {
    "id": 18,
    "text": "Warranty documents, erection certificate, and O&M manuals submitted"
  },
  {
    "id": 19,
    "text": "Structural engineer and manufacturer signoff received (if required)"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• CSA A660, NBC, MBMA Manual, CAN/CSA S16, AISC, ASTM A325/A490"
  },
  {
    "id": "• Manufacturer Specs: Butler, Varco Pruden, Star, Robertson, Metallic, Nucor, Behlen"
  }
]