[
  {
    "id": "A. Submittals & Pre-Installation Review"
  },
  {
    "id": 1,
    "text": "Approved submittals for piping, fittings, valves, insulation, and fixtures received and stamped"
  },
  {
    "id": 2,
    "text": "Plumbing drawings coordinated with structural and architectural (penetrations, slopes, fixture locations)"
  },
  {
    "id": 3,
    "text": "Code compliance verified: NPC, local AHJ amendments, backflow prevention, insulation R-values"
  },
  {
    "id": "B. Rough-In Verification – Water & Drainage"
  },
  {
    "id": 4,
    "text": "Pipe routing and slope per NPC and design (2% minimum slope for drainage, per code)"
  },
  {
    "id": 5,
    "text": "Cold and hot water pipes tested to minimum 100 psi for 2 hours, no leakage"
  },
  {
    "id": 6,
    "text": "DWV tested with air (5 psi for 15 min) or water (10’ head for 15 min)"
  },
  {
    "id": 7,
    "text": "Vents installed at all required locations with proper offsets and above flood rim"
  },
  {
    "id": 8,
    "text": "Backflow preventers and isolation valves installed at designated risers or mechanical rooms"
  },
  {
    "id": 9,
    "text": "Firestopping of penetrations installed and labeled"
  },
  {
    "id": "C. Fixture & Equipment Connection"
  },
  {
    "id": 10,
    "text": "Fixtures installed level, anchored, and piped with approved materials and escutcheons"
  },
  {
    "id": 11,
    "text": "Mixing valves, temperature limiters, and shutoffs installed per drawing"
  },
  {
    "id": 12,
    "text": "Drainage connections properly vented and air gaps provided for indirect connections (e.g., dishwasher, ice maker)"
  },
  {
    "id": 13,
    "text": "Hot water recirculation installed (if applicable) and flow verified"
  },
  {
    "id": "D. Final Inspection & Commissioning"
  },
  {
    "id": 14,
    "text": "All valves, drains, and hose bibbs labeled and tagged"
  },
  {
    "id": 15,
    "text": "All systems flushed, chlorinated (potable), and certified"
  },
  {
    "id": 16,
    "text": "Fixture operation tested (fill/drain, flush, leak check) and clean"
  },
  {
    "id": 17,
    "text": "As-built drawings submitted, O&M manuals turned over"
  },
  {
    "id": 18,
    "text": "Final inspection passed by AHJ and certificate issued"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• National Plumbing Code (NPC 2020, Canada)"
  },
  {
    "id": "• CAN/CSA B64, CSA B125, ASTM D1785, NFPA 24"
  },
  {
    "id": "• Local Municipality/Province Regulations, LEED Water Efficiency Credits"
  }
]