[
  {
    "id": "A. Planning & Permits"
  },
  {
    "id": 1,
    "text": "Geotechnical report confirms rock type, depth, and excavation recommendations"
  },
  {
    "id": 2,
    "text": "Blasting permits or excavation method approvals obtained from local authorities"
  },
  {
    "id": 3,
    "text": "Pre-blast condition survey of adjacent structures completed and documented"
  },
  {
    "id": "B. Site Safety & Blasting Plan"
  },
  {
    "id": 4,
    "text": "Blasting plan reviewed and stamped by certified blaster or geotechnical engineer"
  },
  {
    "id": 5,
    "text": "Blasting mats, warning systems, and exclusion zones in place"
  },
  {
    "id": 6,
    "text": "Seismic monitoring devices installed at nearest sensitive structure/location"
  },
  {
    "id": "C. Mechanical Rock Excavation (if applicable)"
  },
  {
    "id": 7,
    "text": "Hydraulic hammer, ripper, or breaker operating at correct pressure/angle"
  },
  {
    "id": 8,
    "text": "Vibration and noise levels monitored as per equipment specs/local regulations"
  },
  {
    "id": "D. Blast Execution & Monitoring"
  },
  {
    "id": 9,
    "text": "Blasting conducted only during permitted hours with audible/visual alerts"
  },
  {
    "id": 10,
    "text": "Seismograph logs (PPV/duration) recorded and reviewed after each blast"
  },
  {
    "id": 11,
    "text": "Flyrock, overbreak, and ground heave inspected post-blast"
  },
  {
    "id": "E. Post-Blast Inspection & Rock Removal"
  },
  {
    "id": 12,
    "text": "Scaling, trimming, or additional mechanical removal completed as required"
  },
  {
    "id": 13,
    "text": "Rock disposal and haul logs maintained and verified by inspector"
  },
  {
    "id": 14,
    "text": "Excavation to final line, grade, and slope within specified tolerance"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NRCan Blasting Regulations (Canada), CSA Z122, OH&S Part 33 – Blasting"
  },
  {
    "id": "• ASTM D5758, Geotechnical Report, Local Municipality Permit Requirements"
  }
]