[
  {
    "id": "A. Submittals & Mix Design Review"
  },
  {
    "id": 1,
    "text": "Geotechnical engineer’s soil report identifies poor soils and prescribes stabilization"
  },
  {
    "id": 2,
    "text": "Proposed stabilization method (lime, cement, geogrid, chemical) approved and mix design submitted"
  },
  {
    "id": 3,
    "text": "Equipment plan (pulverizer, reclaimer, tiller) and work sequence reviewed"
  },
  {
    "id": "B. Site Prep and Material Delivery"
  },
  {
    "id": 4,
    "text": "Area stripped and graded per plan; loose organic, frozen, or debris material removed"
  },
  {
    "id": 5,
    "text": "Lime/cement stored in silos or dry conditions and verified by weight ticket or daily report"
  },
  {
    "id": 6,
    "text": "Weather conditions suitable (no standing water, temperature >5°C for lime/cement work)"
  },
  {
    "id": "C. Mixing and Blending"
  },
  {
    "id": 7,
    "text": "Material uniformly spread at required rate (kg/m² or % by dry weight)"
  },
  {
    "id": 8,
    "text": "Full-depth mixing using reclaimer or rotary mixer performed per lift thickness"
  },
  {
    "id": 9,
    "text": "Moisture adjusted before and after mixing per geotechnical spec"
  },
  {
    "id": "D. Compaction and Testing"
  },
  {
    "id": 10,
    "text": "Compaction completed within specified time window after mixing"
  },
  {
    "id": 11,
    "text": "Field density and moisture tests recorded and meet % compaction as per modified Proctor"
  },
  {
    "id": 12,
    "text": "Stabilized soil proof-rolled and visually inspected for deflection/pumping"
  },
  {
    "id": "E. Geosynthetics (if applicable)"
  },
  {
    "id": 13,
    "text": "Geotextile/geogrid installed over graded subgrade with overlap and anchorage"
  },
  {
    "id": 14,
    "text": "Fill placed over reinforcement in specified lift thickness without damage"
  },
  {
    "id": "F. Records & Closeout"
  },
  {
    "id": 15,
    "text": "Mix ticket log, QC reports, and final compaction summary submitted"
  },
  {
    "id": 16,
    "text": "As-built stabilization extent and treatment depths verified and recorded"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ASTM D558, D4318, D6276, D698, CSA A3000 Cementitious Standards"
  },
  {
    "id": "• GRI/GCL Geosynthetic Guidelines, Project Geotechnical Report"
  },
  {
    "id": "• Alberta Transportation / AASHTO Soil-Cement, Lime-Treated Soils"
  }
]