[
  {
    "id": "A. Submittals & Design Review"
  },
  {
    "id": 1,
    "text": "Cable type, rating (CMR/LSZH/Plenum), color, and termination types confirmed to match RFP/specs"
  },
  {
    "id": 2,
    "text": "Approved shop drawings showing cable routes, IDF/MDF locations, and quantities"
  },
  {
    "id": 3,
    "text": "Labeling scheme and numbering plan approved and consistent across drawings and racks"
  },
  {
    "id": "B. Backbone and Horizontal Cabling"
  },
  {
    "id": 4,
    "text": "Cable supports (ladder tray, J-hooks, D-rings) installed with max spacing limits per BICSI/NEC"
  },
  {
    "id": 5,
    "text": "Cables run with no kinks, sharp bends, or unpermitted splices"
  },
  {
    "id": 6,
    "text": "Horizontal cable length does not exceed 90m from patch panel to outlet"
  },
  {
    "id": 7,
    "text": "Fiber optic cable installed in innerduct with correct bend radius and pull tension"
  },
  {
    "id": "C. Terminations & Rack Setup"
  },
  {
    "id": 8,
    "text": "Patch panels, jacks, and field terminations are punched down and labeled"
  },
  {
    "id": 9,
    "text": "Patch cords installed with strain relief; no tight bends at connectors"
  },
  {
    "id": 10,
    "text": "Rack layout neat with Velcro, lacing bars, cable managers installed"
  },
  {
    "id": 11,
    "text": "Proper grounding and bonding provided for racks and cable tray"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 12,
    "text": "Copper cable tested with Fluke/BERT for length, NEXT, return loss, and wiremap"
  },
  {
    "id": 13,
    "text": "Fiber tested with OTDR for insertion loss and length"
  },
  {
    "id": 14,
    "text": "Test reports submitted in PDF and original software formats"
  },
  {
    "id": "E. Closeout"
  },
  {
    "id": 15,
    "text": "As-built drawings showing final cable routes and IDs provided"
  },
  {
    "id": 16,
    "text": "O&M documentation including test results, warranties, and cut-sheets submitted"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ANSI/TIA-568.3-D, TIA-606-B, NEC Chapter 8, BICSI 005, CSA T529"
  },
  {
    "id": "• Manufacturer Specs: Leviton, Belden, Panduit, Commscope, Corning, Hubbell, Siemon"
  }
]