[
  {
    "id": "A. Material Delivery and Handling"
  },
  {
    "id": 1,
    "text": "Steel sections match approved shop drawings and specifications"
  },
  {
    "id": 2,
    "text": "Mill certificates available and reviewed for compliance"
  },
  {
    "id": 3,
    "text": "Steel stored off ground, with adequate supports and protection from corrosion"
  },
  {
    "id": 4,
    "text": "Surface finish and coating condition verified (galvanized, primed, etc.)"
  },
  {
    "id": "B. Base Plate and Anchor Bolt Installation"
  },
  {
    "id": 5,
    "text": "Anchor bolts placed as per layout and properly embedded"
  },
  {
    "id": 6,
    "text": "Grouting under base plates complete and cured prior to steel erection"
  },
  {
    "id": 7,
    "text": "Leveling and shim packing under plates checked"
  },
  {
    "id": "C. Erection and Connections"
  },
  {
    "id": 8,
    "text": "Members erected as per erection drawings with correct orientation and alignment"
  },
  {
    "id": 9,
    "text": "Bolt grade, type, and size verified per drawings/specs"
  },
  {
    "id": 10,
    "text": "Bolted connections torqued or tensioned per spec"
  },
  {
    "id": 11,
    "text": "Welded connections per approved WPS (Welding Procedure Specification)"
  },
  {
    "id": 12,
    "text": "Weld inspection completed by certified personnel (CWB or equivalent)"
  },
  {
    "id": 13,
    "text": "Fireproofing or intumescent paint installed if required"
  },
  {
    "id": "D. Alignment and Safety"
  },
  {
    "id": 14,
    "text": "Vertical and horizontal alignment checked with total station or levels"
  },
  {
    "id": 15,
    "text": "Temporary bracing installed during erection to ensure stability"
  },
  {
    "id": 16,
    "text": "Final bolt tightening log submitted"
  },
  {
    "id": 17,
    "text": "As-built marked up drawings prepared"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• CSA S16 – Design of Steel Structures"
  },
  {
    "id": "• CISC Code of Standard Practice for Structural Steel"
  },
  {
    "id": "• AWS D1.1 / CSA W59 – Welding Standards"
  },
  {
    "id": "• NBC Part 4 – Structural Framing Requirements"
  },
  {
    "id": "• Welding & Bolting Inspection Logbook (if applicable)"
  }
]