[
  {
    "id": "A. Submittals & Setup"
  },
  {
    "id": 1,
    "text": "Pump type (storm, sanitary, effluent), GPM/head rating, and NEMA enclosure rating match mechanical schedule"
  },
  {
    "id": 2,
    "text": "Submittals stamped and reviewed, including pump curves, float logic, and control panels"
  },
  {
    "id": 3,
    "text": "Pit sizing and sump depth coordinated with civil and architectural elevations"
  },
  {
    "id": "B. Pit Construction & Equipment Installation"
  },
  {
    "id": 4,
    "text": "Sump pit installed plumb and level, sealed, and protected against groundwater infiltration"
  },
  {
    "id": 5,
    "text": "Concrete base installed under basin and slope provided to suction inlet"
  },
  {
    "id": 6,
    "text": "Pump(s) secured and isolated from vibration; rails and removal guides in place for duplex systems"
  },
  {
    "id": 7,
    "text": "Discharge piping installed with unions, check valves, and isolation valves"
  },
  {
    "id": 8,
    "text": "Float switches, ultrasonic sensors, or pressure transducers mounted per manufacturer instructions"
  },
  {
    "id": 9,
    "text": "Backflow prevention (if discharging to storm main) confirmed"
  },
  {
    "id": "C. Electrical & Controls"
  },
  {
    "id": 10,
    "text": "Control panel installed and labeled; breaker rating and disconnect verified"
  },
  {
    "id": 11,
    "text": "Float levels set to activate lead/lag pumps and alarm under high-level condition"
  },
  {
    "id": 12,
    "text": "High water alarm with light and buzzer tested"
  },
  {
    "id": 13,
    "text": "SCADA/BMS integration confirmed if required"
  },
  {
    "id": "D. Testing & Commissioning"
  },
  {
    "id": 14,
    "text": "Wet test performed: simulate high water levels and verify pump sequence"
  },
  {
    "id": 15,
    "text": "Flow rate and discharge confirmed (if testable)"
  },
  {
    "id": 16,
    "text": "Pump startup log recorded, and manufacturer startup forms completed"
  },
  {
    "id": 17,
    "text": "Final inspection passed by AHJ or mechanical engineer"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• NPC, CSA B128, CSA B73, ASTM C478 (Precast Pits)"
  },
  {
    "id": "• City of Calgary Drainage Design Standards, Local AHJ Inspection Requirements"
  },
  {
    "id": "• Manufacturer Specs: Liberty, Zoeller, Grundfos, Xylem, Myers, Pentair"
  }
]