[
  {
    "id": "A. Material Verification"
  },
  {
    "id": 1,
    "text": "Tile type (ceramic, porcelain, mosaic, natural stone) matches submittals and finish schedule"
  },
  {
    "id": 2,
    "text": "Adhesives, grout, waterproofing membranes, and expansion joints approved and on-site"
  },
  {
    "id": 3,
    "text": "Tile size, color, pattern, and trim/accessory pieces confirmed prior to install"
  },
  {
    "id": 4,
    "text": "Substrate/backer board type and condition verified (Durock, Schluter, cement board, etc.)"
  },
  {
    "id": "B. Substrate Prep & Waterproofing"
  },
  {
    "id": 5,
    "text": "Substrate level, clean, dry, and cured (for concrete)"
  },
  {
    "id": 6,
    "text": "Sloped to drain (for showers, wet rooms, exterior areas)"
  },
  {
    "id": 7,
    "text": "Crack isolation membrane installed if required by spec"
  },
  {
    "id": 8,
    "text": "Waterproofing membrane installed at wet areas, shower walls, pans, etc."
  },
  {
    "id": 9,
    "text": "Waterproofing properly cured and flood-tested if required"
  },
  {
    "id": "C. Tile Installation"
  },
  {
    "id": 10,
    "text": "Tiles laid per pattern (grid, brick, diagonal) and aligned with control joints"
  },
  {
    "id": 11,
    "text": "Mortar bed coverage >90% at wet areas, >80% at dry areas"
  },
  {
    "id": 12,
    "text": "Tile joints uniform in width and spacing"
  },
  {
    "id": 13,
    "text": "Movement joints installed where required (floor transitions, perimeters)"
  },
  {
    "id": "D. Grouting & Finishes"
  },
  {
    "id": 14,
    "text": "Grout type and color approved and consistent"
  },
  {
    "id": 15,
    "text": "Grout joints clean, fully filled, and flush with tile surface"
  },
  {
    "id": 16,
    "text": "Transition trims installed cleanly at changes in flooring or wall finish"
  },
  {
    "id": 17,
    "text": "No lippage or cracked tiles"
  },
  {
    "id": "E. Final Review & Closeout"
  },
  {
    "id": 18,
    "text": "Surface cleaned and free from haze, residue, or construction dust"
  },
  {
    "id": 19,
    "text": "All tile edges properly caulked or grouted (no voids or excessive silicone)"
  },
  {
    "id": 20,
    "text": "Consultant or owner walkthrough completed and signoff received"
  },
  {
    "id": "Code/Standard References:"
  },
  {
    "id": "• ANSI A108 / A118, TCNA Handbook, ASTM C627 – Tile Systems & Standards"
  },
  {
    "id": "• NBC Part 9, CSA A231.1 / ISO 13007"
  },
  {
    "id": "• Manufacturer Specs: Mapei, Schluter, Laticrete, Custom Building Products"
  }
]